Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 238, 238, 32)      896       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 236, 236, 32)      9248      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 118, 118, 32)      0         
_________________________________________________________________
dropout (Dropout)            (None, 118, 118, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 116, 116, 64)      18496     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 114, 114, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 57, 57, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 57, 57, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 207936)            0         
_________________________________________________________________
dense (Dense)                (None, 512)               106463744 
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 20)                10260     
=================================================================
Total params: 106,539,572
Trainable params: 106,539,572
Non-trainable params: 0
_________________________________________________________________
